; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v2 - type_2 ?v1 - type_3)
 	      (pred_4 ?v3 - object ?v1 - type_3)
	      (pred_3 ?v2 - type_2 ?v5 - type_1)
	      (pred_1 ?v2 - type_2 ?v3 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v2 - type_2 ?v7 ?v6 - type_3)
       :precondition (and  (pred_2 ?v2 ?v7))
       :effect (and  (pred_2 ?v2 ?v6)
		     (not (pred_2 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_2 ?v4 - object ?v8 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v8) (pred_2 ?v2 ?v8) (pred_3 ?v2 ?v5))
       :effect (and (pred_1 ?v2 ?v4 ?v5)
		    (not (pred_4 ?v4 ?v8)) 
		    (not (pred_3 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_2 ?v4 - object ?v8 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v4 ?v5) (pred_2 ?v2 ?v8))
       :effect (and (pred_4 ?v4 ?v8)
		    (pred_3 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v4 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_05 - type_2
obj_03 obj_08 obj_01 obj_12 - type_1
obj_02 obj_07 obj_04 - type_3
obj_10 obj_11 obj_09 - object)
(:init
(pred_2 obj_06 obj_07)
(pred_3 obj_06 obj_03)
(pred_3 obj_06 obj_08)
(pred_2 obj_05 obj_02)
(pred_3 obj_05 obj_01)
(pred_3 obj_05 obj_12)
(pred_4 obj_10 obj_02)
(pred_4 obj_11 obj_04)
(pred_4 obj_09 obj_02)
)
(:goal
(and
(pred_4 obj_10 obj_04)
(pred_4 obj_11 obj_07)
(pred_4 obj_09 obj_02)
)
)

(:constraints
  (always (not (pred_2 obj_06 obj_04)))
)
)

; plan
1. (op_2 obj_05 obj_10 obj_02 obj_12)
   deleted: (pred_4 obj_10 obj_02) (pred_3 obj_05 obj_12)
   added: (pred_1 obj_05 obj_10 obj_12)
   goals met: 1 of 3
2. (op_3 obj_05 obj_02 obj_04)
   deleted: (pred_2 obj_05 obj_02)
   added: (pred_2 obj_05 obj_04)
   goals met: 1 of 3
3. (op_1 obj_05 obj_10 obj_04 obj_12)
   deleted: (pred_1 obj_05 obj_10 obj_12)
   added: (pred_4 obj_10 obj_04) (pred_3 obj_05 obj_12)
   goals met: 2 of 3
4. (op_2 obj_05 obj_11 obj_04 obj_12)
   deleted: (pred_4 obj_11 obj_04) (pred_3 obj_05 obj_12)
   added: (pred_1 obj_05 obj_11 obj_12)
   goals met: 2 of 3
5. (op_3 obj_05 obj_04 obj_07)
   deleted: (pred_2 obj_05 obj_04)
   added: (pred_2 obj_05 obj_07)
   goals met: 2 of 3
6. (op_1 obj_05 obj_11 obj_07 obj_12)
   deleted: (pred_1 obj_05 obj_11 obj_12)
   added: (pred_4 obj_11 obj_07) (pred_3 obj_05 obj_12)
   goals met: 3 of 3
